#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.aws_cloudfront_distribution.s3_front_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "s3_front_distribution" {
      ~ comment                        = "[DEV]しおりちゃんカット予約フォーム" -> "しおりちゃんカット予約フォーム"
        id                             = "E134HR8VKS0OMA"
        tags                           = {}
        # (19 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ target_origin_id       = "sio-salon-cut-reserve-dev.s3.ap-northeast-1.amazonaws.com" -> (known after apply)
            # (11 unchanged attributes hidden)
        }

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "sio-salon-cut-reserve-dev.s3.ap-northeast-1.amazonaws.com" -> null
          - origin_access_control_id = "E2MF4EMFP9FI7B" -> null
          - origin_id                = "sio-salon-cut-reserve-dev.s3.ap-northeast-1.amazonaws.com" -> null
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = "E2MF4EMFP9FI7B"
          + origin_id                = (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.app.aws_cloudfront_origin_access_control.frontend_bucket will be updated in-place
  ~ resource "aws_cloudfront_origin_access_control" "frontend_bucket" {
        id                                = "E2MF4EMFP9FI7B"
      ~ name                              = "sio-salon-cut-reserve-dev.s3.ap-northeast-1.amazonaws.com" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.app.aws_s3_bucket.frontend_bucket must be replaced
-/+ resource "aws_s3_bucket" "frontend_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::sio-salon-cut-reserve-dev" -> (known after apply)
      ~ bucket                      = "sio-salon-cut-reserve-dev" -> "sio-salon-cut-reserve-DEV" # forces replacement
      ~ bucket_domain_name          = "sio-salon-cut-reserve-dev.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "sio-salon-cut-reserve-dev.s3.ap-northeast-1.amazonaws.com" -> (known after apply)
      + force_destroy               = false
      ~ hosted_zone_id              = "Z2M4EHUR26P7ZW" -> (known after apply)
      ~ id                          = "sio-salon-cut-reserve-dev" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::sio-salon-cut-reserve-dev/*"
                      - Sid       = "Statement1"
                    },
                  - {
                      - Action    = [
                          - "s3:GetObject",
                          - "s3:PutObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::106994805861:user/SioSalonCutReserveCicd"
                        }
                      - Resource  = "arn:aws:s3:::sio-salon-cut-reserve-dev/*"
                      - Sid       = "Statement2"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "ap-northeast-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      - grant {
          - id          = "3fe46ea3207b642f4ff4d3082ac8c09df954c1f8ece68e05c1cfd5bb5ae5f8dd" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      ~ server_side_encryption_configuration {
          ~ rule {
              ~ bucket_key_enabled = true -> (known after apply)

              ~ apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  ~ sse_algorithm     = "AES256" -> (known after apply)
                }
            }
        }

      - timeouts {}

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ aws_cloudfront_distribution = {
      ~ comment                        = "[DEV]しおりちゃんカット予約フォーム" -> "しおりちゃんカット予約フォーム"
      ~ default_cache_behavior         = [
          ~ {
              ~ target_origin_id            = "sio-salon-cut-reserve-dev.s3.ap-northeast-1.amazonaws.com" -> (known after apply)
                # (18 unchanged elements hidden)
            },
        ]
        id                             = "E134HR8VKS0OMA"
      ~ origin                         = [
          - {
              - connection_attempts      = 3
              - connection_timeout       = 10
              - custom_header            = []
              - custom_origin_config     = []
              - domain_name              = "sio-salon-cut-reserve-dev.s3.ap-northeast-1.amazonaws.com"
              - origin_access_control_id = "E2MF4EMFP9FI7B"
              - origin_id                = "sio-salon-cut-reserve-dev.s3.ap-northeast-1.amazonaws.com"
              - origin_path              = ""
              - origin_shield            = []
              - s3_origin_config         = []
            },
            # (1 unchanged element hidden)
        ]
        tags                           = {}
        # (26 unchanged elements hidden)
    }
  ~ aws_s3_bucket               = {
      ~ acceleration_status                  = "" -> (known after apply)
      ~ acl                                  = null -> (known after apply)
      ~ arn                                  = "arn:aws:s3:::sio-salon-cut-reserve-dev" -> (known after apply)
      ~ bucket                               = "sio-salon-cut-reserve-dev" -> "sio-salon-cut-reserve-DEV"
      ~ bucket_domain_name                   = "sio-salon-cut-reserve-dev.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name          = "sio-salon-cut-reserve-dev.s3.ap-northeast-1.amazonaws.com" -> (known after apply)
      ~ cors_rule                            = [] -> (known after apply)
      ~ force_destroy                        = null -> false
      ~ grant                                = [
          - {
              - id          = "3fe46ea3207b642f4ff4d3082ac8c09df954c1f8ece68e05c1cfd5bb5ae5f8dd"
              - permissions = [
                  - "FULL_CONTROL",
                ]
              - type        = "CanonicalUser"
              - uri         = ""
            },
        ] -> (known after apply)
      ~ hosted_zone_id                       = "Z2M4EHUR26P7ZW" -> (known after apply)
      ~ id                                   = "sio-salon-cut-reserve-dev" -> (known after apply)
      ~ lifecycle_rule                       = [] -> (known after apply)
      ~ logging                              = [] -> (known after apply)
      ~ object_lock_configuration            = [] -> (known after apply)
      ~ object_lock_enabled                  = false -> (known after apply)
      ~ policy                               = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::sio-salon-cut-reserve-dev/*"
                      - Sid       = "Statement1"
                    },
                  - {
                      - Action    = [
                          - "s3:GetObject",
                          - "s3:PutObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::106994805861:user/SioSalonCutReserveCicd"
                        }
                      - Resource  = "arn:aws:s3:::sio-salon-cut-reserve-dev/*"
                      - Sid       = "Statement2"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                               = "ap-northeast-1" -> (known after apply)
      ~ replication_configuration            = [] -> (known after apply)
      ~ request_payer                        = "BucketOwner" -> (known after apply)
      ~ server_side_encryption_configuration = [
          - {
              - rule = [
                  - {
                      - apply_server_side_encryption_by_default = [
                          - {
                              - kms_master_key_id = ""
                              - sse_algorithm     = "AES256"
                            },
                        ]
                      - bucket_key_enabled                      = true
                    },
                ]
            },
        ] -> (known after apply)
      ~ tags                                 = {} -> null
      ~ tags_all                             = {} -> (known after apply)
      ~ timeouts                             = {
          - create = null
          - delete = null
          - read   = null
          - update = null
        } -> null
      ~ versioning                           = [
          - {
              - enabled    = false
              - mfa_delete = false
            },
        ] -> (known after apply)
      ~ website                              = [] -> (known after apply)
      ~ website_domain                       = null -> (known after apply)
      ~ website_endpoint                     = null -> (known after apply)
        # (1 unchanged element hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @YutaCurry, Action: `push`, Working Directory: ``, Workflow: `create PR by github-actions[bot]`*